<template>
    <el-card>
        <div>
            <div class="block-body block-row">
                <p>我们是 <b>{{ forum }}</b> 。我们致力于保护和尊重<b>您</b>的隐私。如果<b>您</b>对<b>您</b>的个人信息有疑问,
                    请点按旁边的"<b>联系我们</b>"选项卡来查看我们的联系方式以联系我们。</p>

                <h2>我们所掌握的关于<b>您</b>的信息</h2>
                <p>我们收集和处理的数据类型包括:</p>
                <ul>
                    <li><b>您</b>的姓名或用户名。</li>
                    <li><b>您</b>的<b>邮箱地址</b>。</li>
                    <li><b>您</b>的 <b>IP</b> 地址。</li>
                </ul>
                <p>如果<b>您</b>选择共享数据, 例如在<b>您</b>的配置文件中填写字段, 则可能会收集到更多资料。</p>
                <p>我们收集以下情况下的部分或全部信息:</p>
                <ul>
                    <li><b>您</b>在该网站上注册为会员。</li>
                    <li><b>您</b>填写我们的联系表格。</li>
                    <li><b>您</b>浏览此网站。请参阅下面的 "Cookie 策略 "。</li>
                    <li><b>您</b>可以在配置文件中填写字段。</li>
                </ul>

                <h2>如何使用<b>您</b>的个人信息</h2>
                <p>我们可以通过以下方式使用<b>您</b>的个人信息:</p>
                <ul>
                    <li>为了使<b>您</b>成为我们网站的注册会员, <b>您</b>可以向本网站投稿。</li>
                    <li>我们可以使用<b>您</b>的<b>邮箱地址</b>通知<b>您</b>活动在我们的网站上。</li>
                    <li>在我们的网站上执行某些操作时, 将记录<b>您</b>的 <b>IP</b> 地址。<b>您</b>的 <b>IP</b> 地址从未公开显示。</li>
                </ul>

                <h2>其他的方式, 我们可以使用<b>您</b>的个人信息。</h2>
                <p>除了通知<b>您</b>在我们的网站上可能与<b>您</b>相关的活动, 我们可能会不时希望与所有成员交流任何重要信息,
                    如新闻稿或电子邮件公告。<b>您</b>可以选择或选择退出<b>您</b>的个人资料中的这些电子邮件。</p>
                <p>在<b>您</b>与我们的网站互动过程中,
                    我们可能会收集<b>您</b>的非个人身份信息。此信息可能包括有关<b>您</b>正在使用的浏览器或设备类型的技术信息。这些信息将纯粹用于分析和跟踪访问我们网站的访问者的数量。</p>

                <h2>保持数据安全</h2>
                <p>我们致力于确保<b>您</b>提供给我们的任何信息都是安全的。为了防止未经授权的访问或披露, 我们已制定适当的措施和程序, 以保障和保障我们收集的资料。</p>

                <h2>Cookie 策略</h2>
                <p><b>Cookie</b> 是由我们在<b>您</b>的计算机上设置的小文本文件, 它允许我们在网站上提供某些功能, 例如能够登录或记住某些首选项。</p>
                <p>我们有一个详细的 <b>Cookie</b> 策略和有关我们在本页上设置的 <b>Cookie</b> 的更多信息。
                </p>

                <h2>权利</h2>
                <p><b>您</b>有权访问我们持有的有关<b>您</b>的个人数据或获取它的副本。为此,
                    请点按旁边的"<b>联系我们"</b>选项卡来查看我们的联系方式以联系我们。如果<b>您</b>认为我们为<b>您</b>保存的信息不完整或不准确, <b>您</b>可以与我们联系,
                    要求我们完成或更正这些信息。</p>
                <p><b>您</b>还有权请求删除<b>您</b>的个人数据。如果<b>您</b>希望我们删除<b>您</b>的个人数据, 请点按旁边的"<b>联系我们"</b>选项卡来查看我们的联系方式以联系我们。
                </p>

                <h2>接受这项政策</h2>
                <p>继续使用我们的网站意味着<b>您</b>接受这一政策。如果<b>您</b>不接受该策略, 请不要使用此网站。注册时, 我们将进一步要求<b>您</b>明确接受隐私政策。</p>

                <h2>对此策略的更改</h2>
                <p>我们可以随时对此政策进行更改。如果将来发生更改, 可能会要求<b>您</b>审阅并重新接受此策略中的信息。</p>






            </div>
        </div>
    </el-card>
</template>

<script>
import config from '../assets/js/config.js'

export default {
    name: 'HelpPrivacy',
    data() {
        return {
            forum: ''
        }
    },
    mounted() {
        this.forum = config.forumName
    }
}
</script>

<style scoped>
p {
    margin-top: 10px
}

.link {
    font-size: 16px;
    margin-bottom: 3px
}
</style>